{"words": ["abandon", "ability", "absent", "absolute", "absorb", "abstract", "abundant", "academy", "accelerate", "accent", "accept", "access", "accident", "accompany", "accomplish", "accord", "account", "accurate", "accuse", "achieve", "acid", "acknowledge", "acquire", "across", "act", "action", "active", "actor", "actual", "adapt", "add", "address", "adequate", "adjust", "administration", "admire", "admit", "adopt", "advance", "advantage", "adventure", "advertise", "advice", "affair", "affect", "afford", "afraid", "after", "afternoon", "again", "against", "age", "agency", "agent", "agree", "agriculture", "ahead", "aid", "aim", "air", "aircraft", "airline", "airplane", "airport", "alarm", "alcohol", "alive", "all", "allow", "almost", "alone", "along", "already", "also", "although", "always", "amaze", "amount", "amuse", "analyze", "ancient", "anger", "angle", "angry", "animal", "announce", "annual", "another", "answer", "anticipate", "anxiety", "anxious", "any", "anyone", "anything", "anyway", "anywhere", "apart", "apartment", "apologize", "apparent", "appear", "appearance", "apple", "application", "apply", "appoint", "appointment", "appreciate", "approach", "appropriate", "approve", "architect", "area", "argue", "arise", "arm", "army", "around", "arrange", "arrest", "arrive", "art", "article", "artist", "ash", "aside", "ask", "asleep", "aspect", "assist", "assistance", "associate", "assume", "assure", "athlete", "atmosphere", "attach", "attack", "attempt", "attend", "attention", "attitude", "attract", "audience", "author", "authority", "automatic", "automobile", "available", "average", "avoid", "awake", "award", "aware", "away", "awful", "about", "above", "according", "activity", "addition", "adult", "ago", "background", "backward", "bacteria", "bad", "bag", "bake", "balance", "ball", "balloon", "ban", "band", "bank", "bar", "bare", "bargain", "bark", "barn", "base", "basic", "basis", "basket", "bat", "bath", "battle", "beach", "bear", "beat", "beautiful", "because", "become", "bed", "bedroom", "beef", "beer", "before", "beg", "begin", "beginning", "behave", "behavior", "behind", "believe", "bell", "belong", "below", "belt", "bench", "bend", "benefit", "beside", "best", "bet", "better", "between", "beyond", "bicycle", "big", "bill", "billion", "bind", "biography", "biology", "bird", "birth", "birthday", "bit", "bite", "black", "blade", "blame", "blank", "blind", "block", "blood", "blow", "blue", "board", "boat", "body", "boil", "bomb", "bond", "bone", "book", "boot", "border", "bore", "born", "borrow", "boss", "both", "bother", "bottle", "bottom", "bowl", "box", "boy", "brain", "branch", "brave", "bread", "break", "breakfast", "breath", "breathe", "brick", "bridge", "brief", "bright", "bring", "broad", "broadcast", "brother", "brown", "brush", "budget", "build", "building", "bullet", "bunch", "burn", "burst", "bury", "bus", "bush", "business", "busy", "but", "butter", "button", "buy", "calculate", "call", "calm", "camera", "camp", "campaign", "campus", "can", "cancel", "cancer", "candidate", "cap", "capable", "capacity", "capital", "captain", "capture", "car", "card", "care", "career", "careful", "careless", "carpet", "carry", "case", "cash", "cast", "castle", "cat", "catch", "category", "cattle", "cause", "cave", "cell", "center", "century", "ceremony", "certain", "chain", "chair", "challenge", "champion", "chance", "change", "channel", "chapter", "character", "charge", "charity", "charm", "chart", "chase", "cheap", "cheat", "check", "cheek", "cheer", "cheese", "chemical", "chemistry", "chest", "chicken", "chief", "child", "childhood", "chocolate", "choice", "choose", "church", "cigarette", "circle", "circumstance", "citizen", "city", "claim", "civil", "class", "classic", "classroom", "clay", "clean", "clear", "clerk", "clever", "click", "client", "climate", "climb", "clock", "close", "cloth", "clothes", "cloud", "club", "coach", "coal", "coast", "coat", "code", "coffee", "coin", "cold", "collapse", "collar", "colleague", "collect", "college", "color", "column", "combination", "combine", "come", "comfort", "command", "comment", "commercial", "commission", "commit", "committee", "common", "communicate", "communication", "community", "company", "compare", "compete", "competition", "complain", "complete", "complex", "computer", "concentrate", "concept", "concern", "concert", "condition", "conduct", "conference", "confidence", "confirm", "conflict", "confuse", "connect", "connection", "conscious", "consider", "considerable", "consist", "constant", "construct", "construction", "consume", "contact", "contain", "container", "contemporary", "content", "contest", "context", "continue", "contract", "contrast", "contribute", "control", "convenient", "conversation", "cook", "cool", "copper", "copy", "corn", "corner", "correct", "cost", "cottage", "cotton", "cough", "could", "council", "count", "country", "couple", "courage", "course", "court", "cousin", "cover", "cow", "crack", "craft", "crash", "crazy", "cream", "create", "creature", "credit", "crew", "crime", "criminal", "crisis", "critic", "critical", "criticism", "crop", "cross", "crowd", "crowded", "cruel", "crush", "cry", "culture", "cup", "cupboard", "cure", "curiosity", "curious", "current", "curtain", "curve", "cushion", "custom", "customer", "cut", "cycle", "damage", "dance", "danger", "dark", "data", "date", "daughter", "dawn", "day", "dead", "deal", "death", "debt", "decade", "decay", "december", "decide", "decision", "declare", "decorate", "decrease", "deep", "defeat", "defend", "defense", "define", "definite", "definition", "degree", "delay", "delegate", "deliver", "demand", "demonstrate", "deny", "depart", "department", "depend", "deposit", "depress", "depth", "derive", "describe", "description", "desert", "design", "desire", "desk", "despair", "destroy", "detail", "detect", "determine", "develop", "development", "device", "devil", "devote", "dictionary", "die", "diet", "differ", "difference", "different", "difficult", "difficulty", "dig", "dinner", "direct", "direction", "director", "dirt", "disappoint", "discover", "discovery", "discuss", "discussion", "disease", "dish", "dismiss", "display", "distance", "distant", "distinct", "distinguish", "distribute", "district", "disturb", "divide", "division", "doctor", "document", "dog", "dollar", "door", "dot", "double", "doubt", "down", "dozen", "draft", "drag", "drain", "drama", "draw", "drawer", "dream", "dress", "drink", "drive", "driver", "drop", "drown", "drug", "drum", "dry", "duck", "due", "dull", "during", "dust", "duty", "each", "eager", "ear", "early", "earn", "earth", "ease", "east", "eastern", "easy", "eat", "economic", "economy", "edge", "edit", "edition", "editor", "educate", "education", "educator", "effect", "effective", "efficient", "effort", "egg", "eight", "either", "elder", "elect", "election", "electric", "electricity", "electronic", "element", "elephant", "eliminate", "else", "elsewhere", "email", "embarrass", "emerge", "emergency", "emotion", "emotional", "employ", "employee", "employer", "employment", "empty", "enable", "encounter", "encourage", "end", "enemy", "energy", "engage", "engine", "engineer", "engineering", "enjoy", "enormous", "enough", "ensure", "enter", "enterprise", "entertain", "entertainment", "enthusiasm", "entire", "entrance", "entry", "environment", "environmental", "equal", "equipment", "era", "error", "escape", "especially", "essential", "establish", "estate", "estimate", "even", "evening", "event", "ever", "every", "everybody", "everyday", "everyone", "everything", "everywhere", "exact", "examine", "example", "excellent", "except", "exception", "exchange", "excite", "excitement", "exciting", "exclude", "excuse", "execute", "exercise", "exhibit", "exhibition", "exist", "existence", "expand", "expansion", "expect", "expense", "expensive", "experience", "experiment", "expert", "explain", "explanation", "explode", "explore", "explosion", "export", "expose", "express", "expression", "extend", "extension", "extensive", "extent", "external", "extra", "extraordinary", "extreme", "eye", "face", "facility", "fact", "factor", "factory", "fail", "failure", "fair", "faith", "fall", "false", "familiar", "family", "famous", "fan", "fancy", "far", "farm", "farmer", "fashion", "fast", "fat", "father", "fault", "favor", "favorite", "fear", "feature", "february", "fee", "feed", "feel", "feeling", "fellow", "female", "fence", "festival", "fetch", "fever", "few", "field", "fifteen", "fifth", "fifty", "fight", "figure", "file", "fill", "film", "final", "finally", "finance", "financial", "find", "fine", "finger", "finish", "fire", "firm", "first", "fish", "fishing", "fit", "five", "fix", "flag", "flame", "flash", "flat", "flavor", "flesh", "flight", "float", "flood", "floor", "flour", "flow", "flower", "fly", "focus", "fold", "folk", "follow", "food", "fool", "foot", "football", "for", "force", "foreign", "forest", "forever", "forget", "forgive", "fork", "form", "formal", "formation", "former", "formula", "fortune", "forward", "found", "foundation", "four", "fourteen", "fourth", "fox", "frame", "free", "freedom", "freeze", "frequency", "frequent", "fresh", "friday", "friend", "friendly", "friendship", "frighten", "from", "front", "fruit", "fuel", "full", "fully", "fun", "function", "fund", "fundamental", "funny", "fur", "furniture", "further", "future", "gain", "game", "gap", "garage", "garden", "gas", "gate", "gather", "general", "generate", "generation", "generous", "gentle", "gentleman", "geography", "get", "giant", "gift", "girl", "give", "glad", "glass", "global", "glove", "goal", "god", "gold", "good", "goodbye", "goods", "govern", "government", "governor", "grab", "grade", "gradually", "grain", "grand", "grandfather", "grandmother", "grant", "grass", "grateful", "grave", "great", "green", "grey", "ground", "group", "grow", "growth", "guarantee", "guard", "guess", "guest", "guide", "guilt", "guilty", "gun", "guy", "habit", "hair", "half", "hall", "hand", "handle", "hang", "happen", "happy", "hard", "hardly", "harm", "hat", "hate", "have", "head", "health", "healthy", "hear", "heart", "heat", "heaven", "heavy", "height", "hell", "hello", "help", "helpful", "her", "here", "hero", "herself", "hide", "high", "hill", "him", "himself", "hire", "his", "historical", "history", "hit", "hold", "hole", "holiday", "home", "homework", "honest", "honor", "hope", "horizon", "horse", "hospital", "host", "hot", "hotel", "hour", "house", "household", "housing", "how", "however", "huge", "human", "humor", "hundred", "hunger", "hunt", "hurry", "hurt", "husband", "hut", "ice", "idea", "ideal", "identify", "identity", "ignore", "ill", "illegal", "illness", "illustrate", "image", "imagination", "imagine", "immediate", "immediately", "import", "important", "impress", "impression", "improve", "improvement", "inch", "incident", "include", "income", "increase", "increasingly", "indeed", "independent", "index", "indicate", "individual", "indoor", "industry", "influence", "inform", "information", "initial", "injury", "ink", "inner", "innocent", "inquiry", "insect", "insert", "inside", "insist", "inspect", "instance", "instant", "instead", "institute", "institution", "instruction", "instrument", "insurance", "intelligence", "intelligent", "intend", "intention", "interest", "interesting", "interior", "internal", "international", "internet", "interpret", "interrupt", "interview", "into", "introduce", "introduction", "invent", "invention", "invest", "investigate", "investment", "invitation", "invite", "involve", "iron", "island", "isolate", "issue", "item", "its", "itself", "jacket", "jail", "jam", "january", "jealous", "job", "join", "joint", "joke", "journal", "journey", "joy", "judge", "judgment", "juice", "july", "jump", "june", "jury", "just", "justice", "justify", "keen", "keep", "key", "kick", "kid", "kill", "kind", "king", "kingdom", "kiss", "kitchen", "knee", "knife", "knock", "know", "knowledge", "lab", "labor", "lack", "ladder", "lady", "lake", "lamp", "land", "language", "large", "last", "late", "lately", "later", "latest", "laugh", "law", "lawyer", "lay", "lead", "leader", "leadership", "leading", "leaf", "league", "learn", "least", "leave", "lecture", "left", "leg", "legal", "legend", "legislation", "lemon", "lend", "length", "less", "lesson", "let", "letter", "level", "library", "license", "lie", "life", "lift", "light", "like", "likely", "limit", "line", "link", "lion", "lip", "liquid", "list", "listen", "literature", "little", "live", "living", "load", "local", "location", "lock", "lonely", "long", "look", "loose", "lose", "loss", "lot", "loud", "love", "lovely", "low", "luck", "lucky", "lunch", "machine", "machinery", "mad", "magazine", "magic", "mail", "main", "maintain", "major", "majority", "make", "male", "man", "manage", "management", "manager", "manner", "manufacture", "many", "map", "march", "margin", "mark", "market", "marriage", "married", "marry", "mass", "master", "match", "material", "mathematics", "matter", "maximum", "may", "maybe", "mayor", "meal", "mean", "meaning", "means", "measure", "measurement", "meat", "mechanic", "mechanical", "mechanism", "medal", "medical", "medicine", "medium", "meet", "meeting", "member", "membership", "memory", "mental", "mention", "menu", "message", "metal", "method", "meter", "middle", "midnight", "might", "mile", "military", "milk", "mill", "million", "mind", "mine", "mineral", "minimum", "minister", "minor", "minority", "minute", "miss", "mission", "mistake", "mix", "mixture", "mobile", "model", "moderate", "modern", "moment", "money", "monitor", "month", "mood", "moon", "moral", "more", "moreover", "morning", "most", "mostly", "mother", "motion", "motor", "mountain", "mouse", "mouth", "move", "movement", "movie", "much", "mud", "multiple", "murder", "muscle", "museum", "music", "musical", "musician", "must", "mutual", "myself", "mystery", "myth", "nail", "name", "narrow", "nation", "national", "native", "natural", "nature", "naval", "navigation", "near", "nearby", "nearly", "necessary", "neck", "need", "needle", "negative", "negotiate", "neighbor", "neither", "nervous", "net", "network", "never", "nevertheless", "new", "news", "newspaper", "next", "nice", "night", "nine", "nineteen", "ninety", "nobody", "nod", "noise", "none", "nor", "normal", "north", "northern", "nose", "not", "note", "nothing", "notice", "novel", "now", "nowhere", "nuclear", "number", "numerous", "nurse", "nut", "object", "objection", "objective", "obligation", "observe", "obtain", "obvious", "occasion", "occasionally", "occupy", "occur", "ocean", "october", "odd", "off", "offense", "offer", "office", "officer", "official", "often", "oil", "okay", "old", "once", "one", "only", "onto", "open", "operate", "operation", "operator", "opinion", "opponent", "opportunity", "oppose", "opposite", "optimistic", "option", "orange", "order", "ordinary", "organization", "organize", "origin", "original", "other", "otherwise", "ought", "ounce", "our", "ours", "ourselves", "out", "outcome", "outdoor", "outside", "outstanding", "over", "overall", "overcome", "owe", "own", "owner", "oxygen", "algebra", "algorithm", "arithmetic", "axiom", "calculus", "cartesian", "combinatorics", "complex number", "conjecture", "correlation", "deduction", "derivative", "determinant", "differential equation", "discrete math", "distribution", "eigenvalue", "eigenvector", "equation", "euclidean", "exponential", "factorial", "fibonacci", "fractal", "geometry", "graph theory", "group theory", "heuristic", "hypothesis", "imaginary number", "induction", "inference", "infinity", "integral", "irrational number", "linear algebra", "logarithm", "logic", "matrix", "modulus", "natural number", "number theory", "numerical analysis", "optimization", "paradox", "permutation", "pi", "polynomial", "prime number", "probability", "proof", "quadratic", "random variable", "rational number", "real number", "recursion", "sequence", "series", "set theory", "sigma notation", "statistics", "symmetry", "tangent", "tensor", "theorem", "topology", "transcendental", "trigonometry", "vector", "vector space", "zero", "abstraction", "agile", "api", "array", "assembler", "assembly", "async", "backend", "big o notation", "binary", "binary search", "boolean", "breakpoint", "buffer", "bug", "byte", "cache", "call stack", "closure", "compiler", "complexity", "concurrency", "cpu", "cryptography", "daemon", "database", "data structure", "deadlock", "debugging", "dependency", "design pattern", "devops", "distributed system", "dns", "docker", "domain", "encapsulation", "endianness", "firewall", "firmware", "framework", "frontend", "full stack", "garbage collection", "git", "graph", "hash", "heap", "hexadecimal", "http", "https", "inheritance", "interface", "interpreter", "ip address", "iteration", "json", "kernel", "latency", "linked list", "load balancer", "localhost", "loop", "machine code", "microservice", "middleware", "mutex", "namespace", "node", "object oriented", "operating system", "packet", "parallel computing", "patch", "pipeline", "pointer", "polymorphism", "port", "process", "protocol", "queue", "ram", "refactoring", "regex", "repository", "rest", "rom", "routing", "runtime", "sandbox", "scheduler", "sdk", "serialization", "server", "session", "socket", "software", "source code", "sql", "ssh", "ssl", "stack", "subnet", "tcp", "thread", "tls", "token", "tree", "udp", "unicode", "unit test", "url", "variable", "virtual machine", "vlan", "vpn", "webhook", "websocket", "xml", "aircrack-ng", "arp spoofing", "backdoor", "bind shell", "black hat", "bluetooth hacking", "brute force", "buffer overflow", "burp suite", "cain and abel", "ciphertext", "cracking", "cve", "cyber kill chain", "ddos", "decryption", "dictionary attack", "digital forensics", "dns spoofing", "dos", "encryption", "enumeration", "exploit", "exploitdb", "footprinting", "forensics", "fuzzing", "gobuster", "hashcat", "honeypot", "hydra", "icmp", "ids", "ike-scan", "impacket", "information gathering", "john the ripper", "kerberos", "keylogger", "kismet", "lateral movement", "linpeas", "log analysis", "malware", "man in the middle", "masscan", "metasploit", "meterpreter", "mimikatz", "mitre att&ck", "msfvenom", "nessus", "netcat", "network scanning", "nikto", "nmap", "nslookup", "openvas", "oscp", "osint", "packet sniffing", "pass the hash", "payload", "pentest", "phishing", "ping", "port scanning", "post exploitation", "privilege escalation", "proxychains", "rainbow table", "ransomware", "reconnaissance", "reverse engineering", "reverse shell", "rootkit", "scanning", "session hijacking", "set", "shellcode", "sniffing", "social engineering", "spoofing", "sql injection", "ssh tunneling", "ssl stripping", "steganography", "sudo", "tcpdump", "threat hunting", "tls fingerprinting", "trojan", "vulnerability", "wardriving", "web shell", "white hat", "wifi cracking", "wireshark", "wps", "xss", "zero day", "zombie", "apt", "aptitude", "apt-get", "arp", "awk", "bash", "binwalk", "blkid", "chroot", "cron", "crontab", "curl", "debian", "df", "dmesg", "dpkg", "elf", "ethtool", "fdisk", "firewalld", "gcc", "gdb", "grep", "grub", "htop", "ifconfig", "init", "iptables", "journalctl", "kali", "ldd", "lsof", "lsusb", "modprobe", "mount", "netstat", "nftables", "nmcli", "passwd", "pci", "pid", "proc", "ps", "python3", "rfkill", "route", "sed", "selinux", "service", "shell", "snap", "strace", "sysctl", "systemctl", "systemd", "tar", "terminator", "tmux", "top", "tor", "traceroute", "ufw", "uname", "update-rc.d", "usb", "useradd", "usermod", "vim", "virtualbox", "vmware", "wget", "which", "whoami", "x11", "xargs", "zsh", "assembly x86", "assembly arm", "bash scripting", "c language", "c++", "c#", "class python", "decorator python", "django", "exception handling", "flask", "function python", "go", "inheritance python", "java", "javascript", "jquery", "json parsing", "kotlin", "lambda python", "list comprehension", "lua", "module python", "mongodb", "node.js", "numpy", "object python", "pandas", "perl", "php", "pip", "postgresql", "powershell", "pyqt", "python", "python asyncio", "python dict", "python flask", "python list", "python oop", "python pandas", "python requests", "python scapy", "python socket", "python threading", "python tkinter", "python tuple", "react", "regex python", "ruby", "rust", "scala", "sql query", "swift", "typescript", "thank", "meanns", "whats", "synchan", "pluss", "teach", "freen", "makes", "sense", "write", "random"], "proficiency": 85.25999999999996, "conversations": 85, "name": "User", "personality": {"friendly": 0.5, "analytical": 0.5}, "dictionary": {"abandon": {"definition": "to leave completely and finally; forsake utterly", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356259"}, "ability": {"definition": "the quality of being able to do something", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356289"}, "absent": {"definition": "not in a certain place at a given time", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356295"}, "absolute": {"definition": "free from restriction or limitation; total", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356300"}, "absorb": {"definition": "to suck up or drink in", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356305"}, "abstract": {"definition": "thought of apart from concrete realities", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356310"}, "abundant": {"definition": "present in great quantity; plentiful", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356314"}, "academy": {"definition": "a school or college for special instruction", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356318"}, "accelerate": {"definition": "to cause faster development or progress", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356323"}, "accent": {"definition": "prominence of a syllable in terms of pitch or stress", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356327"}, "accept": {"definition": "to take or receive something willingly", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356331"}, "access": {"definition": "the ability to enter or approach", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356336"}, "accident": {"definition": "an undesirable or unfortunate happening", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356340"}, "accompany": {"definition": "to go along with; attend", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356345"}, "accomplish": {"definition": "to bring to completion; achieve", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356353"}, "accord": {"definition": "to be in agreement or harmony", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356358"}, "account": {"definition": "a description of events or experiences", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356363"}, "accurate": {"definition": "free from error or defect; precise", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356367"}, "accuse": {"definition": "to charge with a fault or offense", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356371"}, "achieve": {"definition": "to bring to a successful end; accomplish", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356375"}, "acid": {"definition": "a compound usually having a sour taste", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356380"}, "acknowledge": {"definition": "to admit to be real or true; recognize", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356384"}, "acquire": {"definition": "to come into possession of; get", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356389"}, "across": {"definition": "from one side to the other", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356394"}, "act": {"definition": "anything done or to be done; deed", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356398"}, "action": {"definition": "the process or state of acting", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356403"}, "active": {"definition": "engaged in action; characterized by energetic work", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356407"}, "actor": {"definition": "a person who acts in stage plays or movies", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356412"}, "actual": {"definition": "existing in act or fact; real", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356416"}, "adapt": {"definition": "to adjust oneself to different conditions", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356420"}, "add": {"definition": "to unite or join so as to increase the number", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356425"}, "address": {"definition": "a speech or written statement delivered to an audience", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356430"}, "adequate": {"definition": "sufficient for a specific requirement", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356437"}, "adjust": {"definition": "to change so as to match or fit", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356442"}, "administration": {"definition": "the management of any office or organization", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356446"}, "admire": {"definition": "to regard with wonder, pleasure, or approval", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356451"}, "admit": {"definition": "to allow to enter; grant entrance", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356455"}, "adopt": {"definition": "to choose or take as one's own", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356460"}, "advance": {"definition": "to move or bring forward", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356464"}, "advantage": {"definition": "any state or circumstance favorable to success", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356469"}, "adventure": {"definition": "an exciting or very unusual experience", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356474"}, "advertise": {"definition": "to announce or praise in public media", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356479"}, "advice": {"definition": "an opinion or recommendation offered as a guide", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356484"}, "affair": {"definition": "anything done or to be done; business", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356490"}, "affect": {"definition": "to act on; produce an effect or change", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356495"}, "afford": {"definition": "to be able to do or spare something", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356500"}, "afraid": {"definition": "feeling fear; frightened", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356504"}, "after": {"definition": "behind in place or order; next to", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356509"}, "afternoon": {"definition": "the part of the day between noon and evening", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356514"}, "again": {"definition": "once more; another time", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356519"}, "against": {"definition": "in opposition to; contrary to", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356524"}, "age": {"definition": "the length of time during which a being has existed", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356529"}, "agency": {"definition": "an organization or company that provides a service", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356534"}, "agent": {"definition": "a person who acts on behalf of another", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356539"}, "agree": {"definition": "to have the same views or opinions", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356544"}, "agriculture": {"definition": "the science or occupation of cultivating land", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356549"}, "ahead": {"definition": "in or to the front; forward", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356554"}, "aid": {"definition": "to provide support or assistance", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356559"}, "aim": {"definition": "to direct a course or specific purpose", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356564"}, "air": {"definition": "the invisible mixture of gases surrounding the earth", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356568"}, "aircraft": {"definition": "any machine capable of flying", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356574"}, "airline": {"definition": "a system of transporting people by air", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356579"}, "airplane": {"definition": "a heavier-than-air aircraft kept aloft by wings", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356584"}, "airport": {"definition": "a place where aircraft land and take off", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356589"}, "alarm": {"definition": "a sudden fear or distressing suspense", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356594"}, "alcohol": {"definition": "a colorless volatile flammable liquid", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356599"}, "alive": {"definition": "having life; living; not dead", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356604"}, "all": {"definition": "the whole of; every one of", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356610"}, "allow": {"definition": "to permit or let", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356615"}, "almost": {"definition": "very nearly; not quite", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356620"}, "alone": {"definition": "separate from others; solitary", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356625"}, "along": {"definition": "through the length of; in the course of", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356630"}, "already": {"definition": "by this or a specified time", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356635"}, "also": {"definition": "in addition; too; besides", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356640"}, "although": {"definition": "in spite of the fact that", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356645"}, "always": {"definition": "at all times; on every occasion", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356651"}, "amaze": {"definition": "to overwhelm with surprise or sudden wonder", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356657"}, "amount": {"definition": "the sum total of two or more quantities", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356662"}, "amuse": {"definition": "to entertain with laughter or interesting activity", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356668"}, "analyze": {"definition": "to separate into parts or basic principles", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356673"}, "ancient": {"definition": "of or in time long past", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356678"}, "anger": {"definition": "a strong feeling of displeasure and belligerence", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356684"}, "angle": {"definition": "the space within two lines diverging from a point", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356689"}, "angry": {"definition": "feeling or showing anger", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356694"}, "animal": {"definition": "any member of the kingdom Animalia", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356700"}, "announce": {"definition": "to make known publicly or officially", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356705"}, "annual": {"definition": "of or for a year; yearly", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356713"}, "another": {"definition": "being one more or more of the same", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356718"}, "answer": {"definition": "a spoken or written reply or response", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356724"}, "anticipate": {"definition": "to realize beforehand; foretaste or foresee", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356729"}, "anxiety": {"definition": "distress or uneasiness of mind caused by fear", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356735"}, "anxious": {"definition": "full of mental distress or uneasiness", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356740"}, "any": {"definition": "one of a group, without specification", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356746"}, "anyone": {"definition": "any person at all", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356752"}, "anything": {"definition": "any thing whatever; something, no matter what", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356757"}, "anyway": {"definition": "in any manner or way", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356763"}, "anywhere": {"definition": "in or to any place", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356769"}, "apart": {"definition": "into pieces or parts; to pieces", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356774"}, "apartment": {"definition": "a room or a group of related rooms", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356780"}, "apologize": {"definition": "to offer an apology or excuse", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356785"}, "apparent": {"definition": "readily seen or understood; obvious", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356791"}, "appear": {"definition": "to come into sight; become visible", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356797"}, "appearance": {"definition": "the act or fact of appearing", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356802"}, "apple": {"definition": "the usually round red or yellow edible fruit", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356808"}, "application": {"definition": "the act of putting to a special use or purpose", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356814"}, "apply": {"definition": "to make use of as relevant or suitable", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356820"}, "appoint": {"definition": "to name or assign to a position", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356826"}, "appointment": {"definition": "a fixed mutual agreement for a meeting", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356831"}, "appreciate": {"definition": "to be grateful or thankful for", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356837"}, "approach": {"definition": "to come near or nearer to", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356843"}, "appropriate": {"definition": "suitable or fitting for a particular purpose", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356848"}, "approve": {"definition": "to speak or think favorably of", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356854"}, "architect": {"definition": "a person who designs buildings", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356860"}, "area": {"definition": "any particular extent of space or surface", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356866"}, "argue": {"definition": "to present reasons for or against a thing", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356872"}, "arise": {"definition": "to get up from sitting or lying; rise", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356878"}, "arm": {"definition": "the upper limb of the human body", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356884"}, "army": {"definition": "a large body of persons trained and armed for war", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356889"}, "around": {"definition": "on all sides; in every direction", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356896"}, "arrange": {"definition": "to place in proper order; dispose", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356902"}, "arrest": {"definition": "to seize and hold by legal authority", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356908"}, "arrive": {"definition": "to come to a certain point in the course of travel", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356914"}, "art": {"definition": "the quality or expression of what is beautiful", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356923"}, "article": {"definition": "a written composition on a specific subject", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356929"}, "artist": {"definition": "a person who produces works of art", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356935"}, "ash": {"definition": "the powdery residue of matter that remains after burning", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356943"}, "aside": {"definition": "on or to one side; away from the main subject", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356949"}, "ask": {"definition": "to put a question to; inquire of", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356955"}, "asleep": {"definition": "in or into a state of sleep", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356962"}, "aspect": {"definition": "the appearance of something to the eye or mind", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356968"}, "assist": {"definition": "to give support or aid to", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356974"}, "assistance": {"definition": "help or support", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356980"}, "associate": {"definition": "to connect or bring into relation in thought", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356986"}, "assume": {"definition": "to take for granted or without proof", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356993"}, "assure": {"definition": "to declare earnestly or confidently to", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.356999"}, "athlete": {"definition": "a person trained in exercises or games requiring skill", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357007"}, "atmosphere": {"definition": "the gaseous envelope surrounding the earth", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357016"}, "attach": {"definition": "to fasten or join one thing to another", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357022"}, "attack": {"definition": "to set upon with violent force", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357029"}, "attempt": {"definition": "to make an effort at; try", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357035"}, "attend": {"definition": "to be present at", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357045"}, "attention": {"definition": "the act or faculty of concentrating mentally", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357052"}, "attitude": {"definition": "manner or feeling shown in posture or expression", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357058"}, "attract": {"definition": "to draw by appeal to natural interest or emotion", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357064"}, "audience": {"definition": "the group of spectators at a public event", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357071"}, "author": {"definition": "a person who writes a novel, poem, or essay", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357078"}, "authority": {"definition": "the power to determine or settle issues", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357084"}, "automatic": {"definition": "having the capability of starting or operating itself", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357090"}, "automobile": {"definition": "a passenger vehicle designed for operation on roads", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357097"}, "available": {"definition": "suitable or ready for use; accessible", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357103"}, "average": {"definition": "a quantity intermediate to a set of quantities", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357110"}, "avoid": {"definition": "to keep away from; keep clear of", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357116"}, "awake": {"definition": "to wake up; rouse from sleep", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357123"}, "award": {"definition": "to give as due or merited; assign", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357129"}, "aware": {"definition": "having knowledge of something", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357136"}, "away": {"definition": "from this or that place; off", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357142"}, "awful": {"definition": "extremely bad; unpleasant; disagreeable", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:42:49.357148"}, "about": {"definition": "on the subject of; concerning", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.620801"}, "above": {"definition": "at a higher level or layer than", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.620835"}, "according": {"definition": "as stated by or in", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.620852"}, "activity": {"definition": "a thing that a person or group does", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.620874"}, "addition": {"definition": "the action or process of adding", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.620886"}, "adult": {"definition": "a person who is fully grown or developed", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.620907"}, "ago": {"definition": "before the present; earlier", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.620946"}, "background": {"definition": "the part of a picture or scene that is farthest from the viewer", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621276"}, "backward": {"definition": "directed behind or to the rear", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621283"}, "bacteria": {"definition": "microorganisms that are typically a few micrometres in length", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621290"}, "bad": {"definition": "of poor quality or a low standard", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621297"}, "bag": {"definition": "a container used for carrying things", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621304"}, "bake": {"definition": "to cook food by dry heat without direct exposure to a flame", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621310"}, "balance": {"definition": "an even distribution of weight enabling someone to remain upright", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621317"}, "ball": {"definition": "a solid or hollow spherical or egg-shaped object", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621326"}, "balloon": {"definition": "a small inflatable rubber pouch", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621337"}, "ban": {"definition": "to officially or legally prohibit", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621345"}, "band": {"definition": "a flat, thin strip or loop of material", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621351"}, "bank": {"definition": "the land alongside or sloping down to a river", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621358"}, "bar": {"definition": "a long rigid piece of wood or metal", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621364"}, "bare": {"definition": "uncovered; without clothing", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621371"}, "bargain": {"definition": "an agreement between two or more parties", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621378"}, "bark": {"definition": "the sharp explosive cry of certain animals", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621384"}, "barn": {"definition": "a large farm building used for storage", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621391"}, "base": {"definition": "the lowest part or edge of something", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621397"}, "basic": {"definition": "forming an essential foundation", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621405"}, "basis": {"definition": "the underlying support or foundation for an idea", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621412"}, "basket": {"definition": "a container used to hold or carry things", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621419"}, "bat": {"definition": "an implement with a handle and a solid surface", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621439"}, "bath": {"definition": "an act or process of immersing and washing one's body", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621447"}, "battle": {"definition": "a sustained fight between large organized armed forces", "source": "NTC Super Mini English Dictionary", "ingested": "2026-05-23T16:57:45.621454"}, "beach": {"definition": "a 